## 模拟器
### DynamipsGUI基本使用
#### 配置步骤
1. 安装dynamipsgui（设置默认为管理员权限启动）
2. 安装winpcap
3. 启动dynamipsgui
4. 设置设别类型为3640
3640
是一个路由器但支持交换机模块
（既然可以当路由器也可以当交换机）
5. 导入ios文件（基于原有系统生成路由器，英文路径下）
unzip-c3640-js-mz.124-10.bin
6. 计算idle（未使用管理员运行会闪退）
出现yes/no时
'ctrl + ]'同时按住，一起松手，马上按i

会显示如下信息（寄存器值）
   0x604b99ec (count=23)
   0x604eb190 (count=45)
   0x604ebc1c (count=42)
   0x604ebc58 (count=38)
   0x60593c70 (count=51)
   0x60593ce8 (count=28)
   0x604ec500 (count=38)
   0x604ec6b0 (count=71)
   0x6041f880 (count=63)
   0x6041f8e0 (count=56)

选中count值最大的左侧的值并进行复制
粘贴至idle-pc值处

注：计算idle的原因：
如果idle值计算不对，会导致网络设备运行起来后，cpu，内存飙高，
用于适用不同运行架构，运行一次后续就不用再改

7. 设置虚拟RAM（路由器内存）
默认128M
可以调整为256M（避免运行太多功能导致内存溢出）

8. 点击确定（今后不需要再次修改，重启后选择设备3640即可显示选优配置）

9. 配置输出目录
生成路由器文件的位置

10. 点击下一步进入模块位置
   1>选择设备
   Router1
   2>选择设备类型
   3640
   3>选择模块设置Slot0
   NM-1FE-TX
   4>确认RouterX配置（根据设备数量重复操作
   ）
   5>点击下一步
>注：
>|模块|含义|
>|:--:|:--:|
>|NM-16ESW|交换机模块 16个100M网口|
>|NM-1E|1个10M网口  ethernet以太网接口|
>|NM-4E|4个10M接口 以太网接口|
>|NM-1FE-TX|1个100M口 fastethernet 快速以太网接口|
>|NM-4T|4个T1线路串口  Serial串口 1.544M口|

>Cisco 7200 IOS -G-GigabitEthernet 吉比特以太网接口
>1000M 1G

>10G---XGigabitEthernet---TenGigabitEthernet
>万兆口
11. 连接路由器
选中Router1 F0/0接口
选中Router2 F0/0接口
点击连接
![](http://guanxiaoman.cn-sh2.ufileos.com/CCNA%2FCCNA-1.png)
12. 点击 “生成.bat文件” 选项
然后点击退出
进入之前配置的输出目录
D:\Soft\DynamipsGUI-outputdir
CONNINFO.TXT ==》记录之前的连接配置信息
![](http://guanxiaoman.cn-sh2.ufileos.com/CCNA%2FCCNA-2.png)

进入pc1文件夹
运行Router1.bat和Router2.bat，等同于给这两个路由器加电启动
![](http://guanxiaoman.cn-sh2.ufileos.com/CCNA%2FCCNA-3.png)

![](http://guanxiaoman.cn-sh2.ufileos.com/CCNA%2FCCNA-4.png)

13. 使用xshell连接路由器
新建链接 
协议选择telnet
端口 
第一台路由器 2001 
2002 2003 2004 2005
第一台交换机 3001 
3002 3003 3004 3005
一次类推

注：使用xshell过程中  可以使用alt + 1/2/3/4进行窗口切换
![](http://guanxiaoman.cn-sh2.ufileos.com/CCNA%2FCCNA-5.png)
![](http://guanxiaoman.cn-sh2.ufileos.com/CCNA%2FCCNA-7.png)

初次进入会提示是否要进入初始配置对话框，输入no即可进入
![](http://guanxiaoman.cn-sh2.ufileos.com/CCNA%2FCCNA-8.png)

14. 配置路由器IP

```
#Router1
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#host 1
% Hostname contains one or more illegal characters. 

1(config)#int f0/0
1(config-if)#ip add 10.1.1.1 255.255.255.0
1(config-if)#no sh
1(config-if)#
*Mar  1 01:13:14.403: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 01:13:15.403: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
1(config-if)#
1(config-if)#end
1#

#Router2
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#host 2
% Hostname contains one or more illegal characters. 
2(config)#int f0/0
2(config-if)#ip add 10.1.1.2 255.255.255.0
2(config-if)#no sh
2(config-if)#exit
```

15. 测试连通性
```
#Router1
1#ping 10.1.1.2 repeat 10       

Type escape sequence to abort.
Sending 10, 100-byte ICMP Echos to 10.1.1.2, timeout is 2 seconds:
!!!!!!!!!!
Success rate is 100 percent (10/10), round-trip min/avg/max = 12/30/88 ms
```


注：思科网络设备上中断ping
ctrl + 6

### EVE模拟器基本使用